const attractions = [
    {
        src: "./images/attractions/attractions_5.jpg",
        title: "Центральный парк культуры и отдыха",
        fewInfo: "ЦПКиО - это отличное место для проведения свободного времени и в целом прогулки.",
        subTitle: "<span class='important bld'>Краткая</span> история парка",
        info: "Центральный Парк Культуры и Отдыха заложен в 1856 году, первоначально назывался «Казённый сад». История парка восходит к возникновению гражданских поселений вокруг укрепления Верного и развитию промыслов. Впервые парк был заложен как Казённый сад ученым-садоводом Г.Криштопенко в 1856 году в пойме реки Малая Алматинка в качестве места для прогулок и отдыха офицеров Верненского гарнизона. Садовод, имевший опыт работы в Крыму, посадил в саду первые лиственные и хвойные деревья. Для работы он привлек любителей садоводства-верненцев Кутабердина, Сергеева, Чванова и других. Изучив климатические условия, структуру почвы, Криштопенко пришел к выводу, что в Казенном саду, как и на территории всего укрепления, могут расти не только среднеазиатские растения, но и виды, характерные для Центральной России.<br>В 1868 году в Верный были доставлены саженцы и семена из Ташкента, Никитского ботанического сада, Пензенского училища садоводства. В 1874 году Криштопенко передал дела по управлению Казенным садом брату знаменитого верненского лесничего Эдуарда Баума Карлу, благодаря усилиям которого парк превратился в место народных гуляний. <br> В целом это отличное место для прогулки по природе, где есть все для отдыха вещи(даже аттракционы).",
    },
    {
        src: "./images/attractions/attractions_7.jpg",
        title: "КБТУ",
        fewInfo: "КБТУ - это Казахстанско-Британский Технологический Университет.",
        subTitle: '<span class="important bld">История</span> и общая информация об университете.',
        info: "КБТУ - университет мирового уровня, занимающийся научными исследованиями, обучением и подготовкой научной элиты и высококвалифицированных кадров для различных сфер мировой экономики. Мы наводим мост знаний между обществом и наукой, между Казахстаном и остальным миром в таких областях, как технологии и бизнес. Мы уверены в своих силах и возможностях, работая с разными заинтересованными партнерами. Новаторский и творческий подход - приоритет для КБТУ, наши проекты различаются концепцией и решают разные задачи. <br><br> А сама идея создания Казахстанско-Британского технического университета принадлежит Президенту Республики Казахстан Нурсултану Назарбаеву. В целях реализации соглашений и договоренностей в области образования и науки, достигнутых в ходе официального визита Президента Республики Казахстан Н.А.Назарбаева в Соединенное Королевство Великобритании и Северной Ирландии в ноябре 2000 года, Правительством Республики Казахстан было создано АО «Казахстанско-Британский технический университет»",
    },
    {
        src: "./images/attractions/medeo.jpg",
        title: "Медеу",
        fewInfo: "Медеу - национальное достояние и крупнейший каток в Казахстане.",
        subTitle: '<span class="important bld">Медеу</span> - главный лёд страны',
        info: "10 500 квадратных метров льда на высоте 1691 метр над уровнем моря. Самый высокогорный из действующих открытых стадионов. Лидер по количеству установленных мировых рекордов в конькобежном спорте. Самый посещаемый спортивный комплекс в Казахстане. Памятник градостроительства и архитектуры. Урочище «Медеу», а также одноимённый ледовый спортивный комплекс названы в честь Медеу Пусурманова — волостного третьего аула Малоалматинской волости Верненского уезда Семиреченской области. После смерти Медеу в его доме была организована Лесная школа. В 1920 году политруком и писателем Дмитрием Фурмановым было издано решение о создании кумысолечебницы в здании бывшей Лесной школы. Однако санаторий открылся только в 1930 году под названием «М. Д. О.» <br><br> Билеты начинаются от 500 тенге, и самое главное, не забудьте взять с собой коньки(если у Вас имеются), ведь так будет дешевле и спокойнее.",
    },
    {
        src: "./images/attractions/attractions_8.jfif",
        title: "Esentai Mall",
        fewInfo: "Esentai Mall – люкcовый молл, который предлагает особую атмосферу для шопинга и развлечений.",
        subTitle: 'О Esentai Mall',
        info: "Esentai Mall – единственный в Центральной Азии люкcовый молл, который предлагает особую атмосферу для шопинга и развлечений. С открытием Esentai Mall на рынке Казахстана появились фирменные бутики крупных мировых брендов: Louis Vuitton, Gucci, Dolce&Gabbana, которые обозначили новую эру шопинга. В 2013-м году к ним присоединились Dior, Prada, Burberry и др. На сегодняшний день Esentai Mall является самой оживленной частью мультифункционального комплекса <span class='important bld'>Esentai Park</span>, где также расположены отель The Ritz-Carlton Almaty, бизнес-центр Esentai Tower и апартаменты Esentai Apartments. За счет своей развитой инфраструктуры и многочисленных активностей он является точкой притяжения не только для жителей Алматы, но и гостей со всего мира.",
    },
    {
        src: "./images/attractions/attractions_9.jpg",
        title: "ТРЦ MEGA Alma-Ata",
        fewInfo: "MEGA Alma-Ata — это территория комфортного шоппинга и досуга для всей семьи.",
        subTitle: '<span class="important bld">Разные</span> факты о компании и советы',
        info: "В крупным торгово-развлекательном центре MEGA Alma-Ata вы можете отдохнуть как душе угодно. В этом гиганте есть все, что нужное, чтобы удержать Вас в своем здании как можно дольше. Вы можете посмотреть фильмы, заняться шопингом, покушать с различных ресторанов. Отличное место для проведения времени с кем-то вместе). Советуем запастись огромным количеством времени, ведь в этом здании легко заблудиться(но есть карты здания) и долго доходить от точки А до точки Б. <br><br>Первый ТРЦ сети MEGA открыт в Алматы с 2006 года. Вторая очередь MEGA Alma-Ata введена в эксплуатацию в 2013 году. Спустя год распахнул свои двери MEGA Park. Теперь MEGA Alma-Ata и MEGA Park — градообразующие объекты делового, финансового, научно-образовательного, культурного центра страны — Алматы. Торгово-развлекательный центр MEGA Silk Way принял первых гостей в марте 2017 года. Благодаря уникальной архитектуре и концептуальному формату MEGA Silk Way стал новым центром притяжения и визитной карточкой столицы Казахстана — Астаны. Каждый торговый центр по масштабу и архитектурному замыслу не имеет аналогов в градостроительстве страны. Комплексы созданы в соответствии с современными мировыми стандартами, отвечают самым высоким функциональным и эстетическим требованиям современных жителей мегаполисов.",
    },
    {
        src: "./images/attractions/attractions_10.jpg",
        title: "Кок-тобе",
        fewInfo: "Кок-тобе - прекрасное место для вида Алматы сверху.",
        subTitle: '<span class="important bld">Парк</span> отдыха Кок Тобе',
        info: "Парк развлечений «Кок Тобе» — один из символов города Алматы и всего Казахстана, расположенный на пике горы Кок Тобе на высоте 1 100 метров над уровнем моря, в 5 минутах езды от центра города. Летом 2005 года начались работы по усилению склонов и реконструкции парка Кок Тобе В ходе реконструкции полностью заменены все инженерные сети, асфальтированы подъездные дороги, проведена фундаментальная работа по озеленению горы, капитальный ремонт всех объектов инфраструктуры. После проведенной реконструкции облик знаменитой горы изменился. За долгий период из-за отсутствия нужных укреплений возникла угроза обрушения северо-западного склона горы. По этой причине, в сентябре 2014 года канатная дорога была закрыта. Было принято решение о строительстве новой канатной дороги, полной реконструкции северной стороны парка и ресторанного комплекса и возведении нового аттракциона «Колесо обозрения». В 2016 году в марте завершилось строительство канатной дороги и обновленный парк вновь открыл свои двери для всех желающих. <br><br> Подняться на гору Кок Тобе самым волнующим и необычным способом — это стать пассажиром уникальной канатной дороги в Алматы, соединяющий центр города Алматы и Кок Тобе. Отправной точкой служит станция, которая расположена по проспекту Достык. Протяженность канатной дороги составляет 1 620 метров, время в пути — 6 минут, за которые вы сможете понаблюдать за жизнью города сверху — прямо под вами раскинуты зеленые сады, частные дома, а за ними простираются бескрайние городские высотки. Постепенно перед вами откроется новое лицо города, и это действительно незабываемое ощущение. Верхняя станция расположена на территории парка Кок Тобе, который является своеобразными «вратами» в царство кристально чистого воздуха, гостеприимства и неиссякаемого восторга.",
    },
    {
        src: "./images/attractions/attractions_11.jpg",
        title: "Гостиница Казахстан",
        fewInfo: "Отель «Казахстан» - уникальный исторический памятник мегаполиса Алматы, достояние Республики Казахстан.",
        subTitle: '<span class="important bld">История</span>',
        info: "Гостиница строилась в 1975—1977 годах. Здание признано памятником архитектуры и внесено в реестр республиканского значения в 1979 году. Имеет 26 этажей и 102 метра высоты. С 1977 по 2008 год отель являлся самым высоким зданием Алма-Аты. Как сообщается на сайте отеля, гостиница является «самым сейсмостойким высотным зданием Южной столицы». Архитекторы Ю. Г. Ратушный, Л. Л. Ухоботов, А.К, Деев, конструктор Л. Н. Матвиец, директор «Казгорстройпроекта» А. Ш. Татыгулов, начальник строительно-монтажного управления К. Х. Джабасов, главный инженер В. Р. Краснянский и начальник строительного отдела ЦК Компартии В. П. Сытников были выдвинуты на соискание Госпремии СССР, но получили в 1980 году Государственную премию Казахской ССР имени Ч. Валиханова. Первый в сейсмоопасной Алма-Ате небоскреб строительство завершили в 1977г. Не умоляя достоинств новых сооружений, архитекторы Алматы безоговорочно признают: на сегодняшний день Отель «Казахстан» остается самым сейсмостойким и высотным зданием Южной столицы. Из окон гостиницы открывается великолепная панорама снежных вершин Заилийского Алатау. Экологически чистый район, где расположена гостиница, сердце делового и административного центра города Алматы.",
    },
    // {
    //     src: "./images/attractions/attractions_",
    //     title: "",
    //     fewInfo: "",
    //     subTitle: '<span class="important bld">KKL</span>',
    //     info: "",
    // },
    {
        src: "./images/attractions/attractions_4.jpg",
        title: "ORION",
        fewInfo: "Центр бизнес-активности и развитая инфраструктура, успешная работа днем и прогулки в живописном парке вечером.",
        subTitle: '<span class="important bld">Бизнес-центр</span> и жилой комплекс',
        info: "ORION стал одним из символов Алматы. Ведь, он расположен в проспекте Аль-Фараби, где проезжают тысячи машин, много туристов и просто отдыхающих людей. Всякий раз с напоминанием Алматы, многие вспоминают проект компании Bazis, бизнес-центр ORION. <br><br> ORION II является лаконичным продолжением жилого комплекса ORION, образуя с ним единый архитектурный ансамбль. Это проект нового времени, в котором соединились важные составляющие современной городской жизни. Центр бизнес-активности и развитая инфраструктура, успешная работа днем и прогулки в живописном парке вечером – Вы сами выбираете свой образ жизни, сочетая то, что нужно именно Вам. От зеркального фасада и панорамных окон до уютной атмосферы в лобби – все сделано для того, чтобы Вы чувствовали себя центром этой вселенной.",
    },
]

let attractionLocal = (index) => {
    localStorage.setItem("attractionIndex", index)
}

let frames = document.querySelector(".frames")
let showAttractions = () => {
    let output = ""
    for (i in attractions) {
        output += `
            <a onclick="attractionLocal(${i})" href="./attraction.html" class="frame">
                <img src="${attractions[i].src}" alt="">
                <div class="frame_info">
                    <h3>${attractions[i].title}</h3>
                    <p>${attractions[i].fewInfo}</p>
                </div>
            </a>
        `
    }
    frames.innerHTML = output
}


let attraction = document.getElementById("attraction")
let attractionInfo = (i) => {
    let output = ''
    
    output += `
        <div class="card news">
            <div class="card_up">
                <img src="${attractions[i].src}" alt="">
                <h2 class="title attraction">
                    ${attractions[i].title}
                </h2>
            </div>
            <div class="card_down">
                <h3>${attractions[i].subTitle}</h3>
                <p class="desc news">${attractions[i].info}</p>
            </div>
        </div>
    `

    attraction.innerHTML = output
}

window.onload = () => {
    let url = (document.URL).split('https://almaty-now.vercel.app/')
    if (url[1].split(".")[0] == "attractions") {
        showAttractions()
        localStorage.removeItem("attractionIndex")
    }
    else if (url[1].split(".")[0] == "attraction") {
        attractionInfo(localStorage.getItem("attractionIndex"))
        console.log('test');
    }
}